#pragma once

namespace ServerEngine
{
	namespace System
	{
		class Task
		{
		private:
			list<TaskNode *> m_TaskList;
			Thread * m_pThread;
			int m_ID;

		public:
			Task(int ID);
			~Task();

			/****************************************************************************
			함수명	: add
			설명		: taskNode를 리스트에 넣어줌
			리턴값	: 없음
			매개변수	: TaskNode*
			*****************************************************************************/
			void Add(TaskNode *taskNode);

			/****************************************************************************
			함수명	: remove
			설명		: taskNode를 리스트에서 제거함
			리턴값	: 없음
			매개변수	: TaskNode*
			*****************************************************************************/
			void Remove(TaskNode *taskNode);

			/****************************************************************************
			함수명	: process
			설명		: 리스트에서 끝난 taskNode들 제거 및 갱신
			리턴값	: 없음
			매개변수	: 없음
			*****************************************************************************/
			static unsigned int WINAPI Process(LPVOID parm);

			/****************************************************************************
			함수명	: run
			설명		: process를 돌려주는 스레드 생성
			리턴값	: 없음
			매개변수	: 없음
			*****************************************************************************/
			void Run();
		};
	}
}
